{
	"status": "",
	"snippets": [{
		"text": "Gen AI might feel new, but here at The Dock we've been working with it for years. You've now gotten a grasp of the foundational elements required to leverage this tech and the implications for the workforce.\n\nNow let's look at some of the low hanging fruit, the tangible ways this can be implemented now.\n\nMessages:\nGen AI doesn't just change the game; it creates a whole new playing field for the brand – customer relationship.\nThe technology boosts marketing team efficiency, deepens customer insights, sparks greater creativity, and drives higher ROI.\nBrands that understand and leverage the tech will forge deeper, more resilient connections with their customers. Those that don’t will find themselves playing catch-up in a world that's already moved on.\n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "So, looking back at the promise, the optimal cognitive states, we found that these are the results of a calibrated trust. In reality, behind this jagged line of adoption there can be cases of under-trust or over-trust. And it is important for users to become aware of these cases to use the technology to its full potential.\n\nCalibrating trust axes\n\nAs shown here, when trust in the system surpasses its capabilities, there is over-trust, which leads to misuse. Take for example automation bias as a cognitive issue. This is when trust in AI becomes so strong that users ignore or discount other sources of information, including their own instincts. \n\nWhen trust in the system falls short of its capabilities, there is under-trust, which leads to disuse or rejection. For instance, someone in our study encountered functionality glitches and lost the AI outputs: \"I'll try it again, but my learning from the last call was that I still need to scribble and take notes. And maybe over time I'll feel more comfortable about the glitches or there'll be a back-up somewhere... but I won't be fully trusting for a while.\"\n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "\"Some of this is familiarity, or exploration, or desire paths, and some of my objection is ‘legacy thinking’. Whenever we get a new tool, we start by forcing it to fit our existing ways of working, and then over time we change the work to fit the new tool. We try to treat ChatGPT as though it was Google or a database instead of asking what it is useful for. How can we change the work to take advantage of this?\"\nheart 1\nUnbundling AI — Benedict Evans\nChatGPT and LLMs can do anything (or look like they can), so what can you do with them? How do you know? Do we move to chat bots as a magical general-purpose interface, or do we unbundle them back ...\n\n\n\nEmerging personalised Co-pilot applications trained on enterprise data are accelerating targeted knowledge retrieval and enable greater levels of automation across complex tasks. These new capabilities are improving workers self-efficacy, enabling them to engage with their work more confidently, streamlining their tasks, and accelerate their productivity, giving rise to a new employee experience focussed on critical thinking, problem-solving, and creativity. \n\nWorkers will move toward higher value tasks.\n\nProductivity gains on employee experience\nWorkforce psychology\nLearning & onboarding strategies\n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "A recent study of Github Copilot users shows substantial benefits to less experienced developers, with acceptance generally rising over time. This enabled productivity to be more evenly distributed between developers. \n\nAnother study validated this smooth line of adoption for less experienced workers, more specifically, workers who earned less than 20$/hr. Above this threshold of 20$/hr, bargaining power and pushback kicks in, making the adoption line much more jagged. \n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "A recent study of Github Copilot users shows substantial benefits to less experienced developers, with acceptance generally rising over time. This enabled productivity to be more evenly distributed between developers. \n\nAnother study validated this smooth line of adoption for less experienced workers, more specifically, workers who earned less than 20$/hr. Above this threshold of 20$/hr, bargaining power and pushback kicks in, making the adoption line much more jagged. \n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "What we know about how we adopt new technology\nBut reaching these optimal cognitive states is a journey. A journey widely known as tech adoption. So, we will now switch to the functional angle: how will GenAI do the job? What are the expectations vs reality in the workplace? Will employees feel like it’s a smooth transition or a hostile takeover? \n\nFirst, let’s look at history to understand what we know so far about how we adopt new technology.\n\nTools are a core part of human evolution. We do it so that these tools amplify our inherent abilities. The old saying is true “we shape our tools, thereafter they shape us.” Think of the car, the lightbulb, the computer, all these things have massively changed how, where and when we travel, work and think. \n\nIn the 1980s, Steve Jobs compared the computer to a bicycle for the mind, in that it would enable human beings to achieve levels of efficiency like never before. \n\nBut as mentioned previously, GenAI is now more than a tool for efficiency gains. \n\nIt has the potential to redefine the meaning of work. As we outsource human intelligence, imagination and deliberation to GenAI,  we have an opportunity to think about what aspects of our work we want to retain and what aspects we are willing to reinvent. It opens possibilities for developing solutions that arm the workforce with the tools they need to be as creative, strategic and impactful as possible, freed from time-wasting and tedious tasks.\n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "Beyond efficiency - optimal cognitive states\nThe opportunity and what business leaders should aim for is that their workforce to goes beyond efficiency and reaches optimal cognitive states.\n\nWhat do we mean by this? Generative AI is heralded as the tech that can free workers of all levels from repetitive tasks. If this is true, then it would open up time as well as cognitive space for skill matched tasks that some would consider more fulfilling.\n\nFor example, among survey respondents with AI implementations that improved efficiency and decision-making, more than 75% also saw improvements in team morale, collaboration, and collective learning.\n\nImagine: the future workplace optimized for employees to achieve elevated performance, freed from drudgery and working in a state of cognitive harmony.\n\nCognitive states scenarios\n\nWhile what it takes to reach these states is dependent on the individual, there is the need for organisational culture change to enable workers to reach these optimal cognitive states. Prioritizing the needs of the workforce is crucial to the adoption of Gen AI technologies – we’ll explore in the next segment the group-level considerations to technology adoption.\n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "40%-50% of working hours across industries can be impacted by Large Language Models (LLMs).\n\n40% of the workforce would need to reskill as a result of implementing AI and automation over the next 3 years.\n\nFor Consumer Goods & Services – 35% of total working hours could be transformed by LLMs\n\n19.8% through automation, 15.2% through augmentation\n\nAcross the consumer goods workforce – about 50% of roles are most likely to be impacted by either augmentation or automation by AI.\n\nWith these stats in mind, consider these questions:\n\nWhat is the added cognitive (over)load on the workforce during this transitional period?\n\nWhat is the reskilling investment needed to adequately equip the workforce?\n\nWhile the way tasks are performed will change, this doesn’t necessarily mean total loss of jobs…what roles will evolve and what roles will be introduced?\n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "Talk track:\n\nNo doubt, GenAI will be changing how we work, how we accomplish tasks and value skills.\n\nBut to really understand the ways in which AI will transform employee capacity and how to operationally organize your workforce, there is a crucial distinction to make between augmentation and automation. \n\nAugmentation is about enhancing human capabilities (i.e., cyber colleagues) while the latter is about full automation of processes (i.e., automated agitators). Managing the balance between automation and augmentation is a critical consideration for how business leaders map, recruit and retain the top talent needed to drive long-term growth.   \n\nHow do we strike a balance between automation and augmentation?\nWhat are the human factors to consider? \n\nFirst let’s consider the impact of automation or augmentation on the workforce as a whole.\n\n[Poster 1]\n\nMore interestingly, employees will be impacted and experience GenAI differently based on specific industry, role, or function. Think of functions like: Advising, Creating, Coding, Automating Protecting.\n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "How might we best enable humans to co-pilot our business by leveraging tech for the betterment of our people and mission?\nAs you might have heard previously, Human + describes an unprecedented synergy between humans and AI. We believe that AI does not replace but augments and expands human potential. It is time for us to reimagine our relationship with technology and reimagine how organizational capabilities are delivered.\nOne thing is for sure though: AI adoption will not be a straightforward journey for your workforce. And this will look different for each employee. The most important thing for organizations in this transition is for them to learn and adapt to avoid falling into the trap of endless pilots. \nTo guide your understanding of what this will entail for us as humans, we will look at this from 3 angles:\nOperational – from a professional and organizational lens, what are jobs going to look like in a post-AI workforce: what can we expect for the different roles, functions and industries? Will your organization have more cyber colleagues or automated agitators?\nFunctional – from an individual and social lens, what would be the expectations vs reality: how does the employee experience adopting AI look like? Will it feel like a smooth transition or a hostile takeover?\nPsychological – finally, from a human perception standpoint, what does it mean to trust AI and what will it take to calibrate it?\n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "Battle for attention\n•\tOrganisations using AI will shift 75% of their resources away from marketing production by 2025 \n•\t56% of working hours in marketing roles can be transformed by Gen AI \n•\t30% of outbound marketing messages from large organizations will be created with Gen AI by 2025 \n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "Better products faster\n•\t88% of executives agree Gen AI will enhance and augment human creativity \n•\t64% of consumers wish companies would respond faster to meet their changing needs \n•\t30% of enterprises will have implemented an AI-augmented development and testing strategy by 2025  \n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "An experience for everyone\n•\t53% of adults are likely to abandon online purchases without quick answers\n•\t73% of consumers believe AI can have a positive impact on their customer experience \n•\t82% of consumer say that no retailer or service provider has ever communicated with them in a way that felt personalized\n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "Intro/Competitive advantage\n•\t87% of executive leaders surveyed expect job roles to be augmented, rather than replaced, by Gen AI \n•\tdata and technology in product and service innovation \n•\t53% of adults are likely to abandon online purchases without quick answers \n•\t73% of consumer say that no retailer or service provider has ever communicated with them in a way that felt personalized \n•\t80% of executives believe that their company isn’t fully leveraging data and technology in product and service innovation \n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "Gen AI use cases across the value chain\nIdentify customer segments & needs \nSynthetize data from a variety of sources to develop a holistic understanding of potential customer segments and needs \nMap customer journeys\nProvide strategists with a starting point for crafting an end-to-end integrated marketing experience across the customer journey \nInform market research design \nInform the approach and design of market research initiatives in order to build a validated understanding of customer needs and preferences \nResearch market trends\nProcess vast amounts of data from various sources, including social media, customer reviews, and industry reports, to identify emerging trends, sentiment analysis, and consumer insights. \nCompetitive campaign audit\nGenerate a summary of campaign experiences competitors have recently launched to help marketing strategists identify popular themes to expand upon and \"whitespace\" opportunities \nAnalyze primary market research\nQuickly process unstructured data from surveys, interview, and focus groups to provide strategists with insights to help inform the development of new campaigns \nCreate campaign ideas\nSynthesize customer and market insights to quickly generate and iterate campaign ideas, messaging strategies, and more – all guided by human input and creative moderation in order to rapidly identify winning ideas that content, creative, and strategy teams can build out into mature concepts \nCreate prototypes and concept boards \nHaving built out a suite of concepts inspired by customer and market insights, campaign teams can utilize a prototyping tool to rapidly experiment on creative executions to bring the concepts to life by generating mockups, mood boards, storyboards, and more with unimpaired creative freedom \nBrief teams\nAutomatically synthesize insights and artifacts (i.e., ideas, prototypes, etc.) from earlier operations to generate comprehensive briefing documents aimed at providing media, content, creative, and other activation teams with clear, actionable direction for building out campaigns \n\nDevelop creative approaches\nRapidly explore and experiment with new concepts utilizing generative AI prototyping tools that allow design and creative teams to rapidly produce mockups, inspiration boards, storyboards, layouts, and more with unimpaired creative freedom \n\nCreate prototypes and first drafts\n Kick-start content and creative production by creating first draft content that content teams can expertly build out into final pieces \n\nCreative production\nAs a supplement to human-led workstreams, create written, photo and video content, graphic designs, illustrations, and motion graphics where conventional approaches are not practical \n\nCreative post-production\nSupport creative teams with tools to enable more efficient post-production activities – including upscaling, removing backgrounds, replacing objects; applying effects, and more \n\nAutomate scaled production\nApply content models and schemas developed by content creators to automatically produce assets for large collections of products, topics, and other information artifacts \n\nQA creatives\nUtilize predictive analysis to evaluate the effectiveness of content and creative assets before they're flighted for activation. Proactively optimize creatives based on predictive success factors while also identifying potential issues related to brand, accessibility, or regulatory compliance \n\nCopy edit\nReview human-created content for brand alignment and accuracy of messaging claims. Provide prescriptive recommendations to improve human performance and offer to make automatic corrections \n\nCreate variants\nTranslate master assets into compelling, on- brand content and creative experiences across multiple segments, geos, channels, platforms and touchpoints throughout the customer lifecycle \n• Support A/B or multivariate testing\n• Support dynamic templates (i.e., DCO) • Support for localization / transcreation \n\nAscribe metadata\nAutomatically ascribe descriptive metadata to content and creative assets at scale make it easy for team members to activate and evaluate performance \nBuild segments\nProvide strategists and planners with a starting point for developing segmentation and targeting strategies by identifying strategic audiences and building a preliminary understanding of how to engage them online  \nChannel & influencer selection\nHelp media planners identify target media outlets to include in campaigns based on customer intelligence and historical campaign insights \nDevelop SEM keyword targeting \nProvide media planners with a starting point for crafting keywords by referring to a brand's site, message/proposition, promoted products, or product KSPs \nBuild media plan\nProvide media planners with a starting point for identifying target media outlets and potential media mixes for campaigns based on defined target segments, campaign objectives, and historical campaign performance \nGenerate creative variants\nEnable rapid production of creative variants for rotation in dynamic templates or DCO campaigns. Allow creatives and campaign managers to easily transform and manipulate master assets to support a variety of placements and applications. \nPersonalize experiences \nAuto-generate personalized assets based on 1P and 3P data signals to present users with experiences that addresses their specific needs and interests \nSet up campaigns\nBased on a defined media plan, automatically create campaign setup files to feed into programmatic ad platforms and landing pages. \nEngage customers\nDeploy advanced chatbots to engage customers in natural conversations, collecting real-time data on preferences and behavior that can be used to personalize and enrich future customer experiences \nAnalyze performance\nQuickly process large volumes of campaign performance data and use generative AI to provide campaign managers with insights to help guide optimization \nBuild reports\nTranslate campaign data from multiple sources into formatted performance reports ",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "New products, at pace \nCurrent Pressures\n1.\tThe need for speed\n•\tIn an always-on digital economy, customer interests and motivations are constantly evolving with new technologies, business models, and customer expectations emerging at an unprecedented pace. Consumers are becoming increasingly selective, with spending on both discretionary and essential items declining. This is putting pressure on brands to find new way to quickly respond to—and predict—shifting demands to remain relevant and launching products that align with evolving needs\n•\tWhilst 64% of consumers wish companies would respond faster to meet their changing needs, 88% of executives state that they are struggling to keep pace with customers' behavioural changes. There is a clear need for organisations to accelerate their innovation capabilities and become more responsive, agile, and predictive.\n\n2.\tInnovation is too risky and costly\n•\tWhy do 95% of the 30,000 products launched each year fail? This question has greatly impacted the risk appetite of leaders to engage, invest and pursue in breakthrough innovations. With traditional resource-heavy approaches not being able to keep with customer behavioral changes and expectations, organizations need to reimagine their product development processes.\n•\tIneffective market trend research, manual product development processes and resource intensive market testing methods are resulting in long and costly product development cycles, often resulting in a disconnect between product offerings and actual market demand, impacting the success rate of new introductions.\n\n3.\tSo what?\n•\tWith customer needs evolving faster than businesses can keep up, organizations are under pressure to significantly speed up their product development processes to rapidly meet market demands and avoid the high failure rate of new products.\n•\tHow Gen AI is changing everything\n•\tGen AI presents a foundational change in how products are conceived, developed, and launched. The technology is set to introduce an always-on- innovation engine that imagines, creates, de-risks and launches new products and services with unprecedented quality, speed and success.\nHow Gen Ai is reimagining Product development at pace\nFostering a pro-innovation culture \n•\tGenerative AI holds the key to fostering a proactive culture of innovation within organizations. It empowers employees, regardless of technical proficiency, to quickly develop, iterate, and prototype ideas, thereby responding swiftly to immediate challenges \n•\tThe technology allows everyone to engage with complex systems and datasets through natural language, opening new creative horizons for individual workers and a more nuanced understanding of customers by everyone. The automation of repetitive tasks will allow workers to shift their focus to strategic and creative value adding tasks, enhancing individual contributions to the organization's agility, competitiveness, and long-term growth. \nDe-risking innovation \n•\tGenerative AI acts as a creative catalyst, assimilating customer data, market trends, and existing products to provide a greater a deeper understanding of customers multifaceted and nuanced needs, generate novel ideas and designs and test them quickly with synthetic customer personas. It empowers designers and engineers to reimagine the speed of creativity and work. \n•\tBy automating complex formulation processes, enabling rapid prototyping, and simulate market testing, generative AI shortens development cycles and improves quality and market-fit of new products. \nKey Takeaway: \n•\tGenerative AI revolutionizes organizational ability to keep up with both the speed and depth of change, by enabling every employee to find new ways to understand customers, and drive innovation initiatives, and significantly reduce associated costs while improving the success rate. ",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "Current pressures in digital customer experiences \n1.\tExpectations are through the roof putting pressures on service centers \n•\tWith 53% of adults likely to abandon online purchases without quick answers, leading to contact centres having to be under a state of constant pressure to maintain speed of resolution as the volume and complexity of queries continues to grow. \n•\tThis is resulting in the continuous upwards trajectory of OpEx costs and the downwards trajectory of employee and customer satisfaction. High-stress environments for agents lead to attrition rates as high as 25%, on average. With onboarding taking up to 10 weeks per product, this is very costly. \n2.\tDigital experiences are not customer centric \no\tCustomer expectations are soaring. They demand personalized and efficient shopping experiences that offer customized solutions that address their specific needs, yet find themselves navigating increasingly complex buying journeys with current digital experiences being primarily product-focused. \no\tProduct discovery experiences for example are inefficient, requiring customers to search across countless browser tabs, reviews resulting in back and forth decision processes. Digital teams are busy focusing their time on improving product descriptions, images and catalog updates over crafting a customer centric experience around what the customer actyually needs and wants. \n3.\tSo what? \no\tAs customer expectations outpace organisational capabilities, generative AI emerges as a game-changer in its ability to provide entirely new levels of personalization, capable of flexing around each individual rather than algorithms. \nHow Gen AI is changing everything  in customer experiences\nGen AI is driving the next evolution of digital experiences from traditional search models to tailored, AI-driven conversational interfaces. Generative AI will become a layer which sits between every user and the search, search, shopping and brand experiences \nAugmented on-demand self-service \n•\tLLM-powered chatbots and virtual assistants, are boosting service agent capabilities, improve quality of customer self service interactions, and bring marketing, service and sales strategies to the next level. \n•\tThe technology enables 24/7 support that not only reduces pressures on contact centers , it offer sales and marketing new ways to engage in lead nurturing, capture valuable customer data, and streamline sales by delivering personalized pricing, offers, and loyalty programs based on customer purchase and browsing history. \nYour wish is my command \no\tLLM powered commerce chatbots are quickly gaining traction as an opportunity to augment engagement strategies and meet customers' ever-evolving personalization demands. The technology transforms online product discovery into an intuitive conversational experience, providing buyers with a personalised virtual shopping assistants, who can leverage previous order history to better anticipate customer needs, thereby enhancing average order values and conversion rates. \no\tGenerative AI tools such as ChatGPT have already demonstrated the art of the possible for customers when it comes to replacing traditional search methods leading to 43% of consumers who would like to see a broad implementation of generative AI across their interactions with organizations \nKey takeaways \no\t The shift towards conversational experiences will enable organizations to be more in tune with the evolving lifestyles, values, and emotional states of their customers customers and be able to better adapt engagement strategies. \no\tOffering a hyper focused agent fine tuned on niche customers needs will enable organizations to redefine their role in their customer’s reality and go beyond purchasing interactions, to one of a partner. \nKey enablers \nGen AI at its core, is not about automating interaction but about enriching them, making them more relevant, safe, and seamlessly integrated into the existing customer journey. The journey towards implementing generative AI in conversational experiences is multi-faceted that should emphasize safe and accurate interactions and redefine the role and value of human touchpoints. \no\tGuardrails and filters : It’s well-known that LLMs are prone to hallucinations. It’s possible to limit LLM hallucinations by selecting and providing relevant knowledge, but unfortunately this isn’t enough. To mitigate this, a multi-layered filter system is essential. This includes a safety filter to ensure respectful interactions, an accuracy filter to maintain correctness and alignment with the company's policies, and a relevance filter to guarantee the delivery of optimal answers to customer queries. These measures ensure that AI-driven conversations are not just intelligent but also responsible and tailored to the specific context of each customer interaction. \no\tIntegrating next gen experiences : For AI to be most valuable in customer e- commerce experiences, it needs to be able leverage contextual and real time customer data to connect these conversational experiences to existing buyer journeys rather than interrupt them. Retrieval Augmented Generation (RAG), which involves supplementing LLM prompts with up-to-date information is a methodology that benefits from systems integration to enterprise management systems to enhance the accuracy and relevance of responses. Effectively setting up APIs also enable chatbots to take action and perform tasks on behalf of customers such as order tracking. \no\tBalancing human and AI touchpoints : Though generative AI can potentially reduce human-serviced contacts by 50% by handling routine and complex customer queries, balancing intelligent AI interactions with strategic human touchpoints will be vital in orchestrating new customer journeys that make customers feel valued. These new capabilities offer opportunities to free up human capacity for high-value interactions that require higher level of creativity, emotional intelligence and strategic thinking. \n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}, {
		"text": "How gen AI is reimagining the marketing value chain\n1.\tData led and customer centric strategies \n•\tGenerative AI accelerates research and discovery of emerging trends by analyzing data from multiple sources to reveal niche customer needs and patterns, while crafting a holistic, life- centric view of each customer . \n•\tApplications fueled by the latest deep learning models can process massive volumes of data at greater speeds and and generate relevant and actionable insights into customer lifestyles and preferences to strategists, planners, and analysts build and optimize campaigns with greater efficacy. This enables markers to design marketing campaigns that are not just transactional but also add value to the customers' lives. \n2.\tDynamic content creation and optimisation \n• The ability to produce new content grounded in contextual customer data from disparate sources offers unprecedented personalization opportunities that considers a more holistic view of the customer and hyper personalize the engagement. This allows marketing teams to deliver best-in-class customer experiences that meet modern consumer expectations while minimizing time, cost and complexity. \n• Generative AI can continuously monitor performance metrics and adjust content accordingly, ensuring maximum impact and engagement. By leveraging real-time data, businesses can dynamically adapt their content strategy to changing market conditions, seasonal trends, and customer preferences. \nKey Takeaway: \n•\tØ Marketing teams can use generative AI to support campaigns of increasing scale and complexity in shorter timeframes and with fewer resources. \n•\tØ The future of customer engagement strategies lies in its ability to adapt dynamically, not just to market trends but to the evolving narratives of individual consumers. It's a move from mass marketing to mass personalization, where each customer feels like the only customer. \n3.\tKey enablers\nWhile use cases can be activated individually through discrete tools and apps at various stages of the value chain, the true power of gen AI-assisted work is unlocked through the implementation of more holistic solutions that enable broader workflows and mitigate some of the technologies limitations. \no\tFine tuning for brand alignement : The quality, accuracy and relevancy of AI- generated output heavily depend on the quality of the data it’s trained on. Fine- tuning LLMs around enterprise and contextual customer data will dictate the tool’s ability to produce hyper- personalized, brand-aligned, and compliant content that can drive value for the organization. \no\tFact-checking and moderation : Generative AI is probabilistic in nature, meaning that it can generate non-factual content. The resulting abundance of new content will require improved monitoring systems to ensure quality against set parameters and guidelines; and detect risky and non compliant elements. \no\tKeep the Human in the center of creativity : Whilst Generative AI allows creative teams to streamline and automate slow, labor- intensive tasks move staff’s operations from production to more strategic activities, it still takes creative expertise to plan, craft and adapt high-quality original content. Creative professionals should learn to leverage gen AI as a creative copilot that speeds up how ideas get materialized. \n",
		"source": "Shane Casey",
		"source_type": "manual entry",
		"score": 0
	}]
}